read_verilog /doc/zgl/resamplesource/5.22_183/Verilog_hdlsrc/sampleModel61753_pp_45_1_sub_o9_6/Subsystem.v
synth_design -part xc7k70t -top Subsystem
write_verilog -force /doc/zgl/resamplesource/5.22_183/Verilog_hdlsrc/sampleModel61753_pp_45_1_sub_o9_6/Subsystem_vivado.v